---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationX
source: html/9124c552-a3ae-a88b-5480-1154a97750d6.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationX Property

Fixity of translation along X.

## Syntax (C#)
```csharp
public AnalyticalFixityState TranslationX { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The fixity state translationX is not valid for Analytical Link Type parameters.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration